Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eks-openid-policy-object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks-openid-policy-object"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_eks_cluster.eks-cluster-1 will be created
+ resource "aws_eks_cluster" "eks-cluster-1" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-nodzu-cluster-1"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Name" = "nodzu"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.eks-ng-1 will be created
+ resource "aws_eks_node_group" "eks-ng-1" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + cluster_name    = "eks-nodzu-cluster-1"
      + disk_size       = 8
      + id              = (known after apply)
      + instance_types  = [
          + "t3.small",
        ]
      + node_group_name = "eks-nodzu-ng-1"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + tags            = {
          + "Name" = "nodzu"
        }
      + version         = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }
    }

  # aws_iam_openid_connect_provider.eks-openid-provider-1 will be created
+ resource "aws_iam_openid_connect_provider" "eks-openid-provider-1" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + thumbprint_list = []
      + url             = (known after apply)
    }

  # aws_iam_role.eks-admin-role will be created
+ resource "aws_iam_role" "eks-admin-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-admin"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks-ops-admin-role will be created
+ resource "aws_iam_role" "eks-ops-admin-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "eks.amazonaws.com",
                              + "ec2.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Admin role for AWS EKS operations"
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-ops-admin"
      + path                  = "/"
      + tags                  = {
          + "Name" = "nodzu"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks-read-only-role will be created
+ resource "aws_iam_role" "eks-read-only-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-read-only"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-ops-admin"
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-ops-admin"
    }

  # aws_iam_role_policy_attachment.AmazonEKSServicePolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-ops-admin"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-ops-admin"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
+ resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-ops-admin"
    }

  # aws_internet_gateway.igw-1 will be created
+ resource "aws_internet_gateway" "igw-1" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "nodzu"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rtb-1 will be created
+ resource "aws_route_table" "rtb-1" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "nodzu"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.rtb-1-subnet-1-assoc will be created
+ resource "aws_route_table_association" "rtb-1-subnet-1-assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rtb-1-subnet-2-assoc will be created
+ resource "aws_route_table_association" "rtb-1-subnet-2-assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.eks-sg-1 will be created
+ resource "aws_security_group" "eks-sg-1" {
      + arn                    = (known after apply)
      + description            = "Allow all internal traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "All traffic from VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = "nodzu-eks-sg-1"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "nodzu-eks-sg-1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.subnet-1 will be created
+ resource "aws_subnet" "subnet-1" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-north-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "nodzu"
          + "kubernetes.io/cluster/eks-nodzu-cluster-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.subnet-2 will be created
+ resource "aws_subnet" "subnet-2" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-north-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                                      = "nodzu"
          + "kubernetes.io/cluster/eks-nodzu-cluster-1" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.vpc-1 will be created
+ resource "aws_vpc" "vpc-1" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.100.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "nodzu"
        }
    }

  # kubernetes_config_map.rbac-iam-admin-config-map will be created
+ resource "kubernetes_config_map" "rbac-iam-admin-config-map" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nodzu-admin"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_config_map.rbac-iam-read-only-config-map will be created
+ resource "kubernetes_config_map" "rbac-iam-read-only-config-map" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nodzu-read-only"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.eks-rbac-sa-admin will be created
+ resource "kubernetes_service_account" "eks-rbac-sa-admin" {
      + default_secret_name = (known after apply)
      + id                  = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "nodzu-service-account-admin"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.eks-rbac-sa-read-only will be created
+ resource "kubernetes_service_account" "eks-rbac-sa-read-only" {
      + default_secret_name = (known after apply)
      + id                  = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "nodzu-service-account-read-only"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on eks.tf line 2, in resource "aws_eks_cluster" "eks-cluster-1":
   2:   name     = "${var.eks-cluster-1}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 28 more similar warnings elsewhere)


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://chart-example.local/lock?id=nodzu%252Feks-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
